app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $db = $this->db;

        // Statistik utama
        $totalBuku     = $db->table('buku')->countAllResults();
        $totalAnggota  = $db->table('anggota')->countAllResults();
        $totalPinjam   = $db->table('peminjaman')->countAllResults();
        $pending       = $db->table('peminjaman')->where('status', 'pending')->countAllResults();
        $terlambat     = $db->table('peminjaman')
            ->where('status', 'disetujui')
            ->where('tanggal_kembali_rencana <', date('Y-m-d'))
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'disetujui'
AND `tanggal_kembali_rencana` < '2026-04-14'

            ->limit(5)->get()->getResultArray();

        // 5 peminjaman terbaru
        $recentLoans = $db->table('peminjaman p')
            ->select('p.id_peminjaman, p.tanggal_pinjam, p.status, u.nama_lengkap, b.judul_buku')
            ->join('anggota a', 'a.id_anggota = p.id_anggota', 'left')
            ->join('users u', 'u.id_user = a.id_user', 'left')
            ->join('buku b', 'b.id_buku = p.id_buku', 'left')
            ->orderBy('p.created_at', 'DESC')
            ->limit(5)->get()->getResultArray();
---
SELECT `p`.`id_peminjaman`, `p`.`tanggal_pinjam`, `p`.`status`, `u`.`nama_lengkap`, `b`.`judul_buku`
FROM `peminjaman` `p`
LEFT JOIN `anggota` `a` ON `a`.`id_anggota` = `p`.`id_anggota`
LEFT JOIN `users` `u` ON `u`.`id_user` = `a`.`id_user`
LEFT JOIN `buku` `b` ON `b`.`id_buku` = `p`.`id_buku`
ORDER BY `p`.`created_at` DESC
 LIMIT 5