app/Controllers/Admin/LoanController.php

    public function index()
    {
        $status = $this->request->getGet('status') ?? '';
        $search = $this->request->getGet('search') ?? '';

        $builder = $this->db->table('peminjaman p')
            ->select('p.*, u.nama_lengkap as nama_anggota, b.judul_buku, b.pengarang')
            ->join('anggota a', 'a.id_anggota = p.id_anggota', 'left')
            ->join('users u', 'u.id_user = a.id_user', 'left')
            ->join('buku b', 'b.id_buku = p.id_buku', 'left')
            ->orderBy('p.created_at', 'DESC');

        if ($status) $builder->where('p.status', $status);
        if ($search) {
            $builder->groupStart()
                ->like('u.nama_lengkap', $search)
                ->orLike('b.judul_buku', $search)
                ->groupEnd();
        }

        $loans = $builder->get()->getResultArray();
---
SELECT `p`.*, `u`.`nama_lengkap` as `nama_anggota`, `b`.`judul_buku`, `b`.`pengarang`
FROM `peminjaman` `p`
LEFT JOIN `anggota` `a` ON `a`.`id_anggota` = `p`.`id_anggota`
LEFT JOIN `users` `u` ON `u`.`id_user` = `a`.`id_user`
LEFT JOIN `buku` `b` ON `b`.`id_buku` = `p`.`id_buku`
WHERE `p`.`status` = 'pending'
ORDER BY `p`.`created_at` DESC

    public function approve(int $id)
    {
        $peminjamanModel = new PeminjamanModel();
        $loan = $peminjamanModel->find($id);
        if (!$loan || $loan['status'] !== 'pending') {
            return redirect()->to('/admin/loans')->with('error', 'Peminjaman tidak bisa diproses.');
        }

        // Update stok buku
        $bukuModel = new BukuModel();
        $buku = $bukuModel->find($loan['id_buku']);
        if ($buku['stok'] - $buku['dipinjam'] <= 0) {
            return redirect()->to('/admin/loans')->with('error', 'Stok buku tidak tersedia.');
        }

        $bukuModel->update($loan['id_buku'], [
            'dipinjam' => $buku['dipinjam'] + 1,
        ]);

        $peminjamanModel->update($id, [
            'status'         => 'disetujui',
            'diproses_oleh'  => $this->session->get('id_user'),
            'tanggal_proses' => date('Y-m-d H:i:s'),
        ]);

        // Notifikasi ke user
        $anggota = $this->db->table('anggota')->select('id_user')->where('id_anggota', $loan['id_anggota'])->get()->getRowArray();
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '1'
UPDATE `buku` SET `dipinjam` = 1, `updated_at` = '2026-04-14 11:52:37'
WHERE `buku`.`id_buku` IN ('1')
UPDATE `peminjaman` SET `status` = 'disetujui', `diproses_oleh` = '1', `tanggal_proses` = '2026-04-14 11:52:37'
WHERE `peminjaman`.`id_peminjaman` IN (2)
SELECT `id_user`
FROM `anggota`
WHERE `id_anggota` = '2'

    public function reject(int $id)
    {
        $alasan = $this->request->getPost('alasan_penolakan');
        if (!$alasan) {
            return redirect()->back()->with('error', 'Alasan penolakan wajib diisi.');
        }

        $peminjamanModel = new PeminjamanModel();
        $loan = $peminjamanModel->find($id);
        if (!$loan || $loan['status'] !== 'pending') {
            return redirect()->to('/admin/loans')->with('error', 'Peminjaman tidak bisa diproses.');
        }

        $peminjamanModel->update($id, [
            'status'            => 'ditolak',
            'alasan_penolakan'  => $alasan,
            'diproses_oleh'     => $this->session->get('id_user'),
            'tanggal_proses'    => date('Y-m-d H:i:s'),
        ]);

        $buku = $this->db->table('buku')->where('id_buku', $loan['id_buku'])->get()->getRowArray();
        $anggota = $this->db->table('anggota')->select('id_user')->where('id_anggota', $loan['id_anggota'])->get()->getRowArray();
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id_peminjaman` = 3
UPDATE `peminjaman` SET `status` = 'ditolak', `alasan_penolakan` = 'Malas', `diproses_oleh` = '1', `tanggal_proses` = '2026-04-14 11:52:29'
WHERE `peminjaman`.`id_peminjaman` IN (3)
SELECT *
FROM `buku`
WHERE `id_buku` = '1'
SELECT `id_user`
FROM `anggota`
WHERE `id_anggota` = '1'