app/Controllers/Admin/MemberController.php

    public function index()
    {
        $search = $this->request->getGet('search') ?? '';

        $builder = $this->db->table('anggota a')
            ->select('a.*, u.nama_lengkap, u.username, u.email, u.foto_profil, u.status')
            ->join('users u', 'u.id_user = a.id_user', 'left')
            ->orderBy('a.id_anggota', 'DESC');

        if ($search) {
            $builder->groupStart()
                ->like('u.nama_lengkap', $search)
                ->orLike('u.username', $search)
                ->orLike('u.email', $search)
                ->orLike('a.nim_nis', $search)
                ->groupEnd();
        }

        $members = $builder->get()->getResultArray();
---
SELECT `a`.*, `u`.`nama_lengkap`, `u`.`username`, `u`.`email`, `u`.`foto_profil`, `u`.`status`
FROM `anggota` `a`
LEFT JOIN `users` `u` ON `u`.`id_user` = `a`.`id_user`
ORDER BY `a`.`id_anggota` DESC