app/Controllers/Admin/ProfileController.php

    public function index()
    {
        $userModel = new UserModel();
        $user = $userModel->find($this->session->get('id_user'));
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '1'

    public function update()
    {
        $id = $this->session->get('id_user');
        $rules = [
            'nama_lengkap' => 'required|max_length[100]',
            'email'        => "required|valid_email|is_unique[users.email,id_user,$id]",
            'foto_profil'  => 'permit_empty|uploaded[foto_profil]|max_size[foto_profil,2048]|mime_in[foto_profil,image/jpg,image/jpeg,image/png,image/gif]',
        ];
        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $userModel = new UserModel();
        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '1'

            $data['foto_profil'] = $newName;
        }

        $userModel->update($id, $data);
---
UPDATE `users` SET `nama_lengkap` = 'Administrator', `email` = 'admin@perpus.id', `foto_profil` = '1776167614_2eaeacff07f6fb291635.png', `updated_at` = '2026-04-14 11:53:34'
WHERE `users`.`id_user` IN ('1')