app/Controllers/Admin/ReportController.php

    public function index()
    {
        $db = $this->db;

        $totalPinjam = $db->table('peminjaman')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`