app/Controllers/BaseController.php

SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'pending'
---
    protected function getPendingLoanCount(): int
    {
        return (int) $this->db->table('peminjaman')
            ->where('status', 'pending')
            ->countAllResults();

INSERT INTO `notifikasi` (`id_user`, `judul`, `pesan`, `link`, `is_read`, `created_at`) VALUES (3, 'Peminjaman Disetujui', 'Peminjaman buku \"KITAB MASAKAN\" telah disetujui. Silakan ambil buku.', '/user/loans', 0, '2026-04-14 11:52:37')
---
    protected function sendNotification(int $userId, string $judul, string $pesan, string $link = ''): void
    {
        $this->db->table('notifikasi')->insert([
            'id_user'    => $userId,
            'judul'      => $judul,
            'pesan'      => $pesan,
            'link'       => $link,
            'is_read'    => 0,
            'created_at' => date('Y-m-d H:i:s'),
        ]);