app/Models/PeminjamanModel.php

    public function getDetail(int $id): ?array
    {
        return $this->db->table('peminjaman p')
            ->select('p.*, a.nim_nis, a.no_telp, a.alamat,
                      u.nama_lengkap as nama_anggota, u.email as email_anggota,
                      u.foto_profil, u.id_user,
                      b.judul_buku, b.gambar as gambar_buku, b.pengarang, b.penerbit, b.stok,
                      pu.nama_lengkap as nama_pemroses')
            ->join('anggota a','a.id_anggota = p.id_anggota','left')
            ->join('users u','u.id_user = a.id_user','left')
            ->join('buku b','b.id_buku = p.id_buku','left')
            ->join('users pu','pu.id_user = p.diproses_oleh','left')
            ->where('p.id_peminjaman',$id)
            ->get()->getRowArray();
---
SELECT `p`.*, `a`.`nim_nis`, `a`.`no_telp`, `a`.`alamat`, `u`.`nama_lengkap` as `nama_anggota`, `u`.`email` as `email_anggota`, `u`.`foto_profil`, `u`.`id_user`, `b`.`judul_buku`, `b`.`gambar` as `gambar_buku`, `b`.`pengarang`, `b`.`penerbit`, `b`.`stok`, `pu`.`nama_lengkap` as `nama_pemroses`
FROM `peminjaman` `p`
LEFT JOIN `anggota` `a` ON `a`.`id_anggota` = `p`.`id_anggota`
LEFT JOIN `users` `u` ON `u`.`id_user` = `a`.`id_user`
LEFT JOIN `buku` `b` ON `b`.`id_buku` = `p`.`id_buku`
LEFT JOIN `users` `pu` ON `pu`.`id_user` = `p`.`diproses_oleh`
WHERE `p`.`id_peminjaman` = 4